# Информация о проекте:
#  ФИО автора: Погорельских Константин Владимирович
#  Тема ВКР: «Классификация изображений с помощью искусственного интеллекта (на примере Частного образовательного учреждения высшего образования «Московский университет имени С.Ю. Витте»).»
#  ВУЗ: ЧОУ ВО «Московский университет им. С.Ю. Витте»
#  Специальность: Прикладная информатика [09.03.03] Бакалавр
#  Факультет: Информационных технологий
#  Специализация / Профиль подготовки: Искусственный интеллект и анализ данных
#  Учебная группа: ИД 23.3/Б3-21

# Проверка версии
import sys
if sys.version_info < (3, 11):
    print("Clagnosco требуется Python 3.11 или выше")
    sys.exit(0)

# Импорт всех требуемых данных
from tk_run import *

# Запуск Clagnosco
create_gui_main()
